app/controllers/applicants_controller.rb

  def index
    @applicants = Applicant.all
---
SELECT "applicants".* FROM "applicants"

  def search
    @applicants = Applicant.where('name LIKE ?', '%' + params[:q] + '%')
---
SELECT "applicants".* FROM "applicants" WHERE (name LIKE '%naved%') ORDER BY "applicants"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def mine
    @applicants = Applicant.all
---
SELECT "applicants".* FROM "applicants"

  def create
    # @applicant = Applicant.new(applicant_params)
    # @applicant = current_user.build_applicant(applicant_params)
    @applicant = current_user.applicants.build(applicant_params)

    respond_to do |format|
      if @applicant.save
---
INSERT INTO "applicants" ("name", "email", "github_url", "linked_in", "cv_url", "description", "skill1", "skill2", "skill3", "project1", "project1_url", "project2", "project2_url", "project3", "project3_url", "experience1", "experience2", "experience3", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21) RETURNING "id"

  def update
    respond_to do |format|
      if @applicant.update(applicant_params)
---
UPDATE "applicants" SET "name" = $1, "email" = $2, "github_url" = $3, "linked_in" = $4, "cv_url" = $5, "skill1" = $6, "skill2" = $7, "skill3" = $8, "project1" = $9, "project1_url" = $10, "project2" = $11, "project2_url" = $12, "project3" = $13, "project3_url" = $14, "experience1" = $15, "experience2" = $16, "experience3" = $17, "updated_at" = $18 WHERE "applicants"."id" = $19

  def destroy
    @applicant.destroy
---
DELETE FROM "applicants" WHERE "applicants"."id" = $1  [["id", 34]]

  def check
    @ct = current_user.applicants.count
    redirect_to applicants_path, notice: 'Allready created' if current_user.applicants.count >= 1
---
SELECT COUNT(*) FROM "applicants" WHERE "applicants"."user_id" = $1  [["user_id", 4]]
SELECT "applicants".* FROM "applicants" WHERE "applicants"."user_id" = $1 AND "applicants"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 31], ["LIMIT", 1]]
SELECT COUNT(*) FROM "applicants" WHERE "applicants"."user_id" = $1  [["user_id", 3]]

  def correct_user
    @applicant = current_user.applicants.find_by(id: params[:id])
---
SELECT "applicants".* FROM "applicants" WHERE "applicants"."user_id" = $1 AND "applicants"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 34], ["LIMIT", 1]]

  def set_applicant
    @applicant = Applicant.find(params[:id])
---
SELECT "applicants".* FROM "applicants" WHERE "applicants"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]